var data = [
    [
        ["إثناعشرية", "روافض"],
        [
            ["جعفرية", "شيعة", "إمامية"],
            ["كربلاء", "قم", "حسينية"],
            ["جعفر الصادق", "12", "الولاية"],
            ["خميني", "خمينائي"],
        ],
    ],
    [
        ["زيدية"],
        [
            ["شيعة", "حوثيون"],
            ["اليمن"],
            ["زيد بن علي"],
        ],
    ],
    [
        ["إباضية"],
        [
            ["مسند الربيع بن حبيب"],
            ["عمان"],
            ["جابر بن زيد", "عبد الله بن إباض التميمي", "أحمد الخليلي"],
        ],
    ],
    [
        ["مسيحية"],
        [
            ["صليب", "تعميد"],
            ["عيسى", "يحيا المعمداني"],
            ["كنيسة"],
            ["كاثوليك", "أرذوكس"],
        ],
    ],
    [
        ["يهودية"],
        [
            ["توراة", "العهد القديم", "التلمود"],
            ["موسى", "بنو يعقوب", "عبرانيون", "الشعب المختار"],
            ["حاخام"],
            ["كوشير"],
        ],
    ],
    [
        ["الحنيفية"],
        [
            ["إبراهيم"],
            ["الميل عن الشرك", "الميل إلى الحق"],
            ["زيد بن عمرو بن نفيل و قس بن ساعدة", "دين إسماعيل"],
        ],
    ],
    [
        ["معتزلة"],
        [
            ["علم الكلام"],
            ["تقديم العقل على النقل"],
            ["واصل بن عطاء"],
            ["الزمخشري صاحب تفسير الكشاف", "الجاحظ", "الخليفة المأمون", "القاضي عبد الجبار"],
        ],
    ],
    [
        ["خوارج"],
        [
            ["الخروج على الحاكم"],
            ["التكفير بالكبيرة"],
            ["صفرية", "حرورية"],
        ],
    ],
    [
        ["صوفية"],
        [
            ["صوفيا", "الصوف"],
            ["الجنيد", "ابن عربي", "البدوي"],
            ["التيجانية", "النقشبندية", "القادرية"],
        ],
    ],
    [
        ["زواحف"],
        [
            ["تمساح"],
            ["سحلية", "وزغ"],
            ["أفعى"],
        ],
    ],
    [
        ["طيور"],
        [
            ["دجاج", "حمام ", "بط", "وز", "سمان", "نعام"],
            ["نسر", "صقر", "باز", "بوم"],
            ["عصفور", "بلبل"],
            ["نورس"],
        ],
    ],
    [
        ["ثديات"],
        [
            ["خفاش"],
            ["حوت"],
            ["دلفين"],
        ],
    ],
    [
        ["سنوريات"],
        [
            ["قط", "هر"],
            ["أسد", "فهد", "نمر", "النمر الصيّاد"],
            ["يَغْوار", "وشق", "ببر"],
            [
                ["قط بري يلقب أيضا بالنمر القزم يتاوجد في أمريكا الجنوبية", "الأصلوت"]
            ],
        ],
    ],
    [
        ["قوارض"],
        [
            ["فأر", "جذر", "يربوع", "جربوع"],
            ["سنجاب", "أرنب"],
            ["قندس"],
        ],
    ],
    [
        ["حشرات"],
        [
            ["نمل", "نحل", "باعوض"],
            ["عنكبوت", "قمل", "دود"],
            ["صرصور", "جراد", "جندب"],
            ["ارنب"],
        ],
    ],
    [
        ["سمك", "أسماك"],
        [
            ["سردين", "شبوط"],
            ["تونة", "حنكليس"],
            ["قرش"],
        ],
    ],
    [
        ["صغار الحيوان", "صغار الحيوانات"],
        [
            ["شبل", "جرو", "جدي", "هجرس", "جحش"],
            ["فرخ", "حمل", "عجل"],
            ["فرعل", "رأل", "خرنق", "خنوص"],
        ],
    ],
    [
        ["أعضاء"],
        [
            ["عين", "أذن", "أنف"],
            ["كبد", "طحال", "قلب"],
            ["يد", "رجل", "رئة"],
        ],
    ],
    [
        ["جبال"],
        [
            ["هيملايا"],
            ["أطلس"],
            ["أحد"],
        ],
    ],
    [
        ["أنهار"],
        [
            ["نيل", "فرات", "دجلة"],
            ["أمازون"],
            ["فيكتوريا", "رون", "دانوب"],
        ],
    ],
    [
        ["وديان"],
        [
            ["جهنم", "ويل"],
            ["الذئاب"],
            ["ودان"],
        ],
    ],
    [
        ["كواكب"],
        [
            ["أم كلثوم"],
            ["أورانوس", "بلوتو"],
            ["زحل", "عطارد", "الزهرة", "المريخ", "المشتري"],
        ],
    ],
    [
        ["بيض"],
        [
            ["حضن", "عش"],
            ["مح", "أح", "زلال", "قشرة"],
            [
                ["كافيار", "بيض اسماك الخفاش"],
                ["النتل", "بيض النعام"]
            ],
            ["مسلوق", "مقلي", "أوملات"],
        ],
    ],
    [
        ["لحم"],
        [
            ["ستيك", "سمك", "مشوي"],
            ["أحمر", "أبيض"],
            ["مفروم"],
            ["بيت"],
        ],
    ],
    [
        ["مشتقات الحليب"],
        [
            ["جبن"],
            ["زبدة"],
            ["لبن", "رائب"],
        ],
    ],
    [
        ["ملابس"],
        [
            ["قفاز"],
            ["سروال"],
            ["قميص"],
        ],
    ],
    [
        ["صحابة"],
        [
            ["سلمان الفارسي", "صهيب الرومي", "خالد بن الوليد"],
        ],
    ],
    [
        ["الخلفاء الراشدون"],
        [
            ["أبو بكر الصديق"],
            ["عمر بن الخطاب"],
            ["عثمان بن عفان"],
            ["علي"],
        ],
    ],
    [
        ["صحابيات"],
        [
            ["أروى بنت عبد المطلب", "فاطمة بنت محمد"],
            ["أسماء بنت أبي بكر"],
            ["هند بنت عتبة", "الخنساء", "أسماء بنت عميس"],
        ],
    ],
    [
        ["زوجات النبي"],
        [
            ["عائشة بنت أبي بكر"],
            ["خديجة بنت خويلد"],
            ["حفصة بنت عمر"],
            ["نسيبة بنت كعب", "سمية بنت خياط"],
        ],
    ],
    [
        ["تابعيين"],
        [
            ["أويس القرني"],
            ["سعيد بن المسيب"],
            ["الحسن البصري"],
            ["ابن سيرين"],
        ],
    ],
    [
        ["تابعيات"],
        [
            ["حفصة بنت سيرين"],
            ["عائشة بنت سعد بن أبي وقاص"],
            ["صفية بنت أبي عبيد بن مسعود الثقفية"],
        ],
    ],
    [
        ["انصار"],
        [
            ["أوس", "خزرج", "بنو قيلة"],
            [, "سعد بن عبادة", "سعد بن معاذ"],
            ["البراء بن معرور", "أبيّ بن كعب"],
            ["أنس بن مالك", "حسان بن ثابت", "معاذ بن جبل"],
        ],
    ],
    [
        ["مهاجرون", "مبشرون بالجنة"],
        [
            ["سعد بن أبي وقاص", "سعيد بن زيد"],
            ["الزبير بن العوام", "طلحة بن عبيد الله"],
            ["أبو عبيدة بن الجراح", "عبد الرحمن بن عوف"],
        ],
    ],
    [
        ["محمد"],
        [
            ["أحمد"],
            ["الحاشر", "الماحي", "العاقب"],
            ["الشافع المشفع"],
        ],
    ],
    [
        ["كتب سماوية"],
        [
            ["القرآن"],
            ["الزابور"],
            ["التوراة"],
            ["الإنجيل"],
        ],
    ],
    [
        ["رسل"],
        [
            ["جبريل"],
            ["الملائكة"],
        ],
    ],
    [
        ["أنبياء"],
        [
            ["إدريس"],
            ["آدم"],
            ["يعقوب"],
        ],
    ],
    [
        ["أنبياء بني إسرائيل"],
        [
            ["موسى", "هارون"],
            ["سليمان"],
            ["داوود"],
            ["عيسى", "يوسف"],
        ],
    ],
    [
        ["أنبياء عرب"],
        [
            ["محمد"],
            ["شعيب"],
            ["إسماعيل"],
            ["صالح"],
        ],
    ],
    [
        ["أولو العزم"],
        [
            ["موسى"],
            ["نوح"],
            ["محمد"],
            ["عيسى"],
        ],
    ],
    [
        ["عبادات"],
        [
            ["صوم", "حج"],
            ["صلاة"],
            ["البر بالوالدين", "التسبيح"],
        ],
    ],
    [
        ["متنبئين", "متنبيين"],
        [
            ["ابو الطيب"],
            ["مسيلمة"],
        ],
    ],
    [
        ["حلال"],
        [
            ["جراد", "سمك"],
            ["طحال", "كبد"],
            ["المُذكّى"],
        ],
    ],
    [
        ["أكلات مغاربية", "أكلات مغربية", "مطبخ مغربي"],
        [
            ["حريرة", "كسكس", "كسكسي", "المفتول"],
            ["طاجين"],
            ["شباكية", "كعب غزال"],
            ["الشاي الأخضر بالنعناع"],
        ],
    ],
    [
        ["أكلات فرنسية"],
        [
            ["النقانق", "بطاطا مقلية", "الضفادع", "خبز الباجيت الطويل"],
            ["Camembert", " Roquefort", " Brie"],
            ["كرواسون", " crêpes", " الميل فوي"],
        ],
    ],
    [
        ["أكلات مصرية"],
        [
            ["فول", "طعمية", "بامية", "كشك", "فسيخ"],
            ["العيش البلدي", "الكشري", "ملوخية"],
            ["كحك العيد", "مهلبيه"],
            ["العرقسوس"],
        ],
    ],
    [
        ["أكلات تركية"],
        [
            ["الكباب", "الشورمة", "البوريك", "دولمة"],
            ["إسكندر كباب", ""],
            ["البقلاوة", "القهوة"],
        ],
    ],
    [
        ["أكلات شامية"],
        [
            ["الكبة", "فتوش", "مكدوس", "شنكليش"],
            ["المنسف", "المقلوبة"],
            ["كنافة", "قطايف", "بلح", "بقلاوة", "عش البلبل", "هريسة"],
            ["جبن مجدول", "شكشوكة", "بابا غنوج"],
        ],
    ],
    [
        ["أكلات خليجية"],
        [
            ["المفطح", "الكبسة", "المطازيز", "المنسف", "القرصان", "المراصيع", "الصيادية", "دغابيس", ""],
            ["الهريس", "الجريش", "الثريد", "المجبوس"],
            ["السمبوسة", "بلاليط"],
            ["الكنعد", "الربيان"],
        ],
    ],
    [
        ["بلد مسلم"],
        [
            ["السعودية", "المغرب", "الجزائر", "مصر", "قطر"],
            ["إندونيسيا", "باكستان", "بنغلادش"],
            ["ألبانيا", "تركيا", "نيجر", "المالي"],
        ],
    ],
    [
        ["الهند"],
        [
            ["البوذية", "السيخ", "براهما"],
            ["تاج محل", "نهر الغانج"],
            ["كلكاتا", "دلهي", "نيودلهي", "مومباي", "كشمير", "البنجاب"],
            ["روبية", "السنسكريتية", "مستعمرة بريطانية", "البرياني"],
        ],
    ],
    [
        ["الجزائر"],
        [
            ["جزر"],
            ["الأمير عبدالقادر", "بومدين", "مالك بن نبي"],
            ["شمال إفريقيا", "المغرب الأوسط"],
        ],
    ],
    [
        ["تونس"],
        [
            ["قرطاجة", "جربة"],
            ["جامع الزيتونة"],
            ["الطاهر بن عاشور", "حنبعل"],
            ["شمال إفريقيا", "المغرب الكبير"],
        ],
    ],
    [
        ["موريطانيا"],
        [
            ["بلاد شنقيط", "بلد مليون الشاعر"],
            ["ولد", "الأمل بأرض خضراء", "نجمة ذهبية وهلال بلون رمال الصحراء ", "نواكشوط"],
            ["شمال إفريقيا", "المغرب الكبير"],
        ],
    ],
    [
        ["سويسرا"],
        [
            ["بنوك", "ذهب"],
            ["جبن", "شكولاتة", "نستله", "Lindt & Sprüngli"],
            ["الساعات الفاخرة", "swatch"],
        ],
    ],
    [
        ["إيطاليا"],
        [
            ["روما", "الفاتيكان", "صقلية", "سردينيا"],
            ["Ferrero Rocher"],
            ["بيتزا", "المعكرونة"],
        ],
    ],
    [
        ["فرنسا"],
        [
            ["السوربون"],
            ["بلد الجن والملائكة", "بلاد الغال"],
            ["renault", " peugeot"],
        ],
    ],
    [
        ["المملكة المتحدة", "بريطانيا"],
        [
            ["ساعة بيغ بن"],
            ["آيرلندا الشمالية", "ويلز", "إسكتلندا", "الكومنولث"],
            ["شوكولاتة كيت كات", "شوكولاتة مارس"],
            ["وحش لوخ نس"],
        ],
    ],
    [
        ["اليابان"],
        [
            ["هيروشيما", "ساموراي", "نينجا"],
            ["الروبوتات", "أنمي / مانغا"],
            ["السوشي"],
        ],
    ],
    [
        ["المغرب"],
        [
            ["طاجين"],
            ["جامع القرويين"],
            ["الأرغان"],
        ],
    ],
    [
        ["ليبيا"],
        [
            ["شمال إفريقيا", "قبائل الليبو"],
            ["المدن الثلاث"],
            ["القذافي", "عمر مختار"],
        ],
    ],
    [
        ["مصر"],
        [
            ["فرعون", "أهرام"],
            ["سطح الأرض"],
            ["قناة", "نهر"],
        ],
    ],
    [
        ["ألمانيا"],
        [
            ["هتلر"],
            ["فولس فاكن"],
            ["ايمانويل كانت"],
        ],
    ],
    [
        ["الولايات المتحدة"],
        [
            ["جورج", "لينكون"],
            ["جبل راشمور"],
            ["ألاسكا"],
        ],
    ],
    [
        ["إسبانيا"],
        [
            ["الأندلس"],
            ["مصارعة الثيران"],
        ],
    ],
    [
        ["روسيا"],
        [
            ["ماء الحياة", "الدب"],
            ["الأكبر مساحةً"],
            ["فلاديمير"],
        ],
    ],
    [
        ["الميكسيك"],
        [
            ["المايا", "التولتك", "الأزتك"],
            ["يوم الموتى", "سبيدي غونزاليس"],
            ["المخدرات", "التاكو", "مصارعة الثيران"],
        ],
    ],
    [
        ["البرازيل"],
        [
            ["البن"],
            ["كرة القدم"],
            ["الموز"],
        ],
    ],
    [
        ["إثيوبيا"],
        [
            ["المهجر الأول"],
            ["النجشي", "في القرن", "أصحمة بن أبجر", "بلال بن رباح"],
            ["الأمهرية", "الزهرة الجديدة"],
        ],
    ],
    [
        ["تمثال"],
        [
            ["صنم"],
            ["الحرية"],
            ["زوس"],
        ],
    ],
    [
        ["شوكولاطة"],
        [
            ["كيت كات"],
            ["مارس"],
            ["فيريرو روشي"],
        ],
    ],
    [
        ["زمن", "وقت", "زمان"],
        [
            ["قرن", "سنة", "شهر", "أسبوع", "يوم"],
            ["رزنامة", "يومية"],
            ["ساعة", "دقيقة", "ثانية", "جزء من الثانية"],
            ["ظرف", "فعل", "ماضي", "مضارع"],
        ],
    ],
    [
        ["عام"],
        [
            ["الفيل", "الحزن"],
            ["355", "354", "365", "366"],
            ["سبح", "طفى"],
        ],
    ],
    [
        ["حرب"],
        [
            ["عالمية", "الخليج"],
            ["البسوس", "داحس والغبراء"],
            ["الخنادق", "العصابات"],
            ["معارك", "قتلى", "دماء", "أسلحة"],
        ],
    ],
    [
        ["ميثولوجيا", "أساطير"],
            [
		["هرقل", "أخيل"],
		["تارتاروس", "لوكي", "كرونوس", "زوس"],
		["أسغارد", "وحش لوخ نس"],
            ],
        ],
        [
            ["آلهة وثنية"],
            [
                ["زوس", "أراس", "أثينا", "بوسيدون", "أبولو", "أرتميس", "هيرا", "هيدز"],
                ["مارس"],
                ["تارتاروس", "جايا", "كرونوس", "كاوس"],
                ["ثور", "أودين", "لوكي", "فرييا"],
            ],
        ],
        [
            ["أبطال أسطوريون"],
            [
                ["هرقل", "أخيل"],
                ["جلجامش", "أبو زيد الهلالي"],
                ["سوبرمان"],
            ],
        ],
        [
            ["أماكن أسطورية"],
            [
                ["وادي عبقر", "وبار"],
                ["أطلانطس", "كاميلوت"],
                ["قارة مو", "المدينة الفاضلة", "ليموريا"],
                ["أسغارد", "فالهالا"],
            ],
        ],
        [
            ["قصص أسطورية"],
            [
                ["راغناروك", "هوبيتس"],
                ["أرض العملاق"],
                ["شارلك هولمز", "وحش لوخ نس"],
            ],
        ],
        [
            ["الترك"],
            [
                ["مجان"],
                ["اتركوهم  ما تركوكم"],
                ["الخيل والشعر"],
            ],
        ],
        [
            ["طعمية وفلافل"],
            [
                [" فول + حمص+ كمون + كزبرة + ثوم + بصل"],
            ],
        ],
        [
            ["كفتة"],
            [
                ["لحم مفتت + حب القمح + ملح + سمن"],
            ],
        ],
        [
            ["شكشوكة"],
            [
                ["بصل + طماطم + زيت + ملح + بيض"],
            ],
        ],
        [
            ["فاس"],
            [
                ["سنة 1200"],
                ["القرويين"],
                ["جديد و قديم"],
            ],
        ],
        [
            ["مطاط"],
            [
                ["شجر الهيفيا"],
                ["البرازيل"],
                ["السيارات"],
            ],
        ],
        [
            ["السعودية"],
            [
                ["صر طليحان"],
                ["عرعر"],
                ["عين زبيدة"],
            ],
        ],
        [
            ["الزئبق"],
            [
                ["الميزان"],
                ["سائل"],
                ["الزاووق"],
            ],
        ],
        [
            ["الماء"],
            [
                ["الحياه"],
                ["الجنة"],
                ["شفاف"],
            ],
        ],
        [
            ["يوم القيامة"],
            [
                ["الغيب"],
                ["الميزان"],
                ["العدل"],
            ],
        ],
        [
            ["شط"],
            [
                ["حار"],
                ["بحر"],
                ["رمل"],
            ],
        ],
        [
            ["شراب"],
            [
                ["شعير"],
                ["جوارب"],
                ["سائل"],
            ],
        ],
        [
            ["عرس"],
            [
                ["حيوان"],
                ["زفاف"],
                ["مسرح"],
            ],
        ],
        [
            ["كلب"],
            [
                ["براقش "],
                ["نوح"],
                ["حيوان "],
            ],
        ],
        [
            ["ذكاء"],
            [
                ["دلفين"],
                ["شامبانزي "],
                ["إنسان"],
            ],
        ],
        [
            ["مصر"],
            [
                ["اهرامات"],
                ["الشيخ "],
                ["فرعون"],
            ],
        ],
        [
            ["روسيا"],
            [
                ["ستالينغراد"],
                ["بوشكين "],
                ["لينين"],
                ["كرملن"],
            ],
        ],
        [
            ["هيكل"],
            [
                ["محمد حسنين"],
                ["شاسيه"],
                ["سليمان"],
                ["عظمي"],
            ],
        ],
        [
            ["ابن هيثم"],
            [
                ["الرؤية"],
                ["بطليموس"],
                ["نظرية الاعداد"],
            ],
        ],
        [
            ["تابث بن قرة"],
            [
                ["الشمس"],
                ["8 دقايق"],
                ["العالم العربي"],
            ],
        ],
        [
            ["الكهرباء"],
            [
                ["تسلا"],
                ["اديسون"],
                ["المكبس"],
            ],
        ],
        [
            ["البخيل"],
            [
                ["الجاحظ"],
                ["هلال بن عامر بن صعصعة"],
                ["مامون ابو العطى"],
            ],
        ],
        [
            ["مسرحية المتزوجون"],
            [
                ["سمير  غانم"],
                ["الفن الرابع"],
                ["شيرين"],
            ],
        ],
        [
            ["مسرحية مدرسة المشاغبين"],
            [
                ["سهير البابلي"],
                ["الي سالم"],
                ["سعيد صالح"],
            ],
        ],
        [
            ["مسرحية العيال كبرت"],
            [
                ["سلطان"],
                ["كمال"],
                ["يونس شلبي"],
            ],
        ],
        [
            ["مامون و شركائه"],
            [
                ["عادل امام"],
                ["يوسف معاطي"],
                ["رامي امام"],
            ],
        ],
        [
            ["الكبائر"],
            [
                ["الزنا"],
                ["الخمر"],
                ["الربا"],
            ],
        ],
        [
            ["الحرام"],
            [
                ["الخمر"],
                ["الزنا"],
                ["النفاق"],
            ],
        ],
        [
            ["الرباط"],
            [
                ["زواج"],
                ["المغرب"],
                ["الخيل"],
            ],
        ],
        [
            ["الحلال"],
            [
                ["التمر"],
                ["العسل "],
                ["الزواج"],
            ],
        ],
        [
            ["الكمبيوتر"],
            [
                ["الانترنت"],
                ["الوحدة المركزية"],
                ["البالتولك"],
            ],
        ],
        [
            ["الفرس"],
            [
                ["ايران"],
                ["العرب "],
                ["الخيل"],
            ],
        ],
        [
            ["النجاح"],
            [
                ["المدرسة"],
                ["الفرحة"],
                ["المال"],
            ],
        ],
        [
            ["النساء"],
            [
                ["الفتنة"],
                ["المجتمع"],
                ["المكياج"],
            ],
        ],
        [
            ["جدار"],
            [
                ["المبكى"],
                ["البناء"],
                ["القدرة"],
            ],
        ],
        [
            ["غلام"],
            [
                ["الطفل"],
                ["العبد"],
                ["من بني هاشم و الحجاج"],
            ],
        ],
        [
            ["مدينة"],
            [
                ["المنورة"],
                ["العتيقة"],
                ["الفاضلة"],
            ],
        ],
        [
            ["دكان"],
            [
                ["الرزق"],
                ["التحطيم"],
                ["كشك"],
            ],
        ],
        [
            ["القران الكريم"],
            [
                ["جبريل"],
                ["الله"],
                ["الرسول"],
            ],
        ],
        [
            ["سورة"],
            [
                ["الدجال"],
                ["الكهف"],
                ["النصف"],
            ],
        ],
        [
            ["سورة"],
            [
                ["القران"],
                ["من مسميات الرسول"],
                ["القلب"],
            ],
        ],
        [
            ["الطبيعة"],
            [
                ["الاشجار"],
                ["الإلحاذ"],
                ["الامازون"],
            ],
        ],
        [
            ["مكة"],
            [
                ["المركز"],
                ["النور"],
                ["الإيمان"],
            ],
        ],
        [
            ["الثقلان"],
            [
                ["البشر"],
                ["الجن"],
                ["الخلق"],
            ],
        ],
        [
            ["الزعفران"],
            [
                ["الذهب"],
                ["اللون"],
                ["التوابل"],
            ],
        ],
        [
            ["الاصنام"],
            [
                ["هبل"],
                ["مناه"],
                ["ذو الرصة"],
            ],
        ],
        [
            ["الكيد"],
            [
                ["الخديعة"],
                ["الثعلب"],
                ["النساء"],
            ],
        ],
        [
            ["الوطن"],
            [
                ["فلسطين"],
                ["الإنتماء"],
                ["الإيمان"],
            ],
        ],
        [
            ["السحر"],
            [
                ["الفودو"],
                ["الهودو"],
                ["الافارقة و اليهود"],
            ],
        ],
        [
            ["مطاط"],
            [
                ["شجر الهيفيا"],
                ["البرازيل"],
                ["السيارات"],
            ],
        ],
        [
            ["السعودية"],
            [
                ["صر طليحان"],
                ["عين زبيدة"],
                ["عرعر"],
            ],
        ],
        [
            ["الزئبق"],
            [
                ["الميزان"],
                ["سائل"],
                ["الزاووق"],
            ],
        ],
        [
            ["الماء"],
            [
                ["الحياه"],
                ["الجنة"],
                ["شفاف"],
            ],
        ],
        [
            ["يوم القيامة"],
            [
                ["الغيب"],
                ["الميزان"],
                ["العدل"],
            ],
        ],
        [
            ["اللسان"],
            [
                ["الذوق"],
                ["الاكل"],
                ["لعاب"],
            ],
        ],
        [
            ["مثلت"],
            [
                ["هرم"],
                ["رياضيات"],
                ["برومودا"],
            ],
        ],
        [
            ["الاحجار الكريمة"],
            [
                ["الفحم الحجري"],
                ["المرجان"],
                ["الياقوت"],
            ],
        ],
        [
            ["التلفزيون"],
            [
                ["الرائي"],
                ["الإرسال"],
                ["الفضاء"],
            ],
        ],
        [
            ["المغرب"],
            [
                ["الفسفاط"],
                ["الكرم"],
                ["الكسكس"],
            ],
        ],
        [
            ["الصعيد"],
            [
                ["الشنب"],
                ["الثأر"],
                ["التراب"],
            ],
        ],
        [
            ["عقرب"],
            [
                ["نار"],
                ["سم"],
                ["موت"],
            ],
        ],
        [
            ["الوحي"],
            [
                ["جبريل"],
                ["الرسل"],
                ["القرآن"],
            ],
        ],
        [
            ["الإبتسامة"],
            [
                ["الصدقة"],
                ["الفرح"],
                ["سر آسر و سلطان قاهر"],
            ],
        ],
        [
            ["هنري فورد"],
            [
                ["السيارة"],
                ["السرعة"],
                ["الإبداع"],
            ],
        ],
        [
            ["المال و البنون"],
            [
                ["الحياة الدنيا"],
                ["مجدي ابو عميرة"],
                ["يوسف شعبان"],
            ],
        ],
        [
            ["الساعة"],
            [
                ["الغيب"],
                ["الاعداد"],
                ["السيف"],
            ],
        ],
        [
            ["رمضان"],
            [
                ["الحسنات"],
                ["القران"],
                ["سحور"],
            ],
        ],
        [
            ["السحور"],
            [
                ["الفجر"],
                ["الإمساك"],
                ["الابيض و الاسود"],
            ],
        ],
        [
            ["العجائب السبعة"],
            [
                ["مصر"],
                ["العراق"],
                ["زيوس"],
            ],
        ],
        [
            ["السلم"],
            [
                ["العمل"],
                ["العلو"],
                ["بيع عين مالية موصوفة في الذمة"],
            ],
        ],
        [
            ["الجنة"],
            [
                ["الإيمان"],
                ["رحمه الرحمن"],
                ["النهاية"],
            ],
        ],
        [
            ["القهوة"],
            [
                ["تركيا"],
                ["العرب"],
                ["الحبشة"],
            ],
        ],
        [
            ["السكين"],
            [
                ["جبير"],
                ["السلاح"],
                ["الغمد"],
            ],
        ],
        [
            ["الرغيف"],
            [
                ["العجيب"],
                ["الاكل"],
                ["الدائرة"],
            ],
        ],
        [
            ["البرازيل"],
            [
                ["البرتغالية"],
                ["كرة القدم"],
                ["امريكا الجنوبية"],
            ],
        ],
        [
            ["سلطنة عمان"],
            [
                ["باب السلام"],
                ["مجان"],
                ["النحاس"],
            ],
        ],
        [
            ["اكل رمضان"],
            [
                ["البسبوسة"],
                ["الشباكية"],
                ["الحريرة"],
            ],
        ],
        [
            ["ابل"],
            [
                ["الفاكهة"],
                ["القوة و الفلوس"],
                ["الهاتف"],
            ],
        ],
        [
            ["البالتولك"],
            [
                ["الشات"],
                ["عناد"],
                ["الالوان"],
            ],
        ],
        [
            ["الاتحاد السوفياتي"],
            [
                ["الشيوعية"],
                ["لينين"],
                ["ستالين"],
            ],
        ],
        [
            ["المعادن"],
            [
                ["البشر"],
                ["النحاس"],
                ["الحديد"],
            ],
        ],
        [
            ["الكيمياء"],
            [
                ["ماري كوري"],
                ["جابر"],
                ["بابلو كويلو"],
            ],
        ],
        [
            ["الجيش"],
            [
                ["السي"],
                ["السلاح"],
                ["القوة"],
            ],
        ],
        [
            ["الاخضر"],
            [
                ["الخس"],
                ["الشجر"],
                ["السعودية"],
            ],
        ],
        [
            ["القلم"],
            [
                ["أنا التواب أتوب على من تاب"],
                ["الحبر"],
                ["الكتابة"],
            ],
        ],
        [
            ["السيلكون"],
            [
                ["الرقم"],
                ["الخرسانة"],
                ["سان فرانسيسكو"],
            ],
        ],
        [
            ["البدو"],
            [
                ["الأعراب"],
                ["الرحل"],
                ["الإبل"],
            ],
        ],
        [
            ["الاحمر"],
            [
                ["الياقوت"],
                ["الدم"],
                ["النار"],
            ],
        ],
        [
            ["الرسم"],
            [
                ["فان كوخ"],
                ["موناليزا"],
                ["زهرة الخشخاش"],
            ],
        ],
        [
            ["الطبيب"],
            [
                ["الكحال"],
                ["المرض"],
                ["الدواء"],
            ],
        ],
        [
            ["القنبلة الذرية"],
            [
                ["الطفل الصغير"],
                ["هاري ترومان"],
                ["لعبة الحرب"],
            ],
        ],
        [
            ["الاحلام"],
            [
                ["إبن سيرين"],
                ["النوم"],
                ["العقل"],
            ],
        ],
        [
            ["إبن"],
            [
                ["سينا"],
                ["قيم"],
                ["خلدون"],
            ],
        ],
        [
            ["الشيب"],
            [
                ["إبراهيم عليه السلام"],
                ["الابيض"],
                ["الوقار"],
            ],
        ],
        [
            ["المخدرات"],
            [
                ["الخشخاش"],
                ["سليل"],
                ["الإدمان"],
            ],
        ],
        [
            ["اليابان"],
            [
                ["الإبداع"],
                ["العيون الصغيرة"],
                ["الأسطول البحري"],
            ],
        ],
        [
            ["الجنود"],
            [
                ["القوة"],
                ["السلطة"],
                ["الأنصار والأعوان"],
            ],
        ],
        [
            ["الفضاء"],
            [
                ["المريخ"],
                ["المشتري"],
                ["الانهائي"],
            ],
        ],
        [
            ["القلب"],
            [
                ["مضغة"],
                ["الدم"],
                ["الحب"],
            ],
        ],
        [
            ["مخالب"],
            [
                ["النسر"],
                ["النمر"],
                ["إنقضاض"],
            ],
        ],
        [
            ["الشرك"],
            [
                ["الصياد"],
                ["الشبكة"],
                ["الكفر"],
            ],
        ],
        [
            ["شرطة"],
            [
                ["مدرسة"],
                ["جوجل"],
                ["بحث"],
            ],
        ],
        [
            ["حظ"],
            [
                ["النرد"],
                ["السعادة"],
                ["الجوكر"],
            ],
        ],
        [
            ["خليل"],
            [
                ["إبراهيم"],
                ["الصداقة"],
                ["CH3COOH"],
            ],
        ],
        [
            ["سلطة"],
            [
                ["شوكة"],
                ["الخس"],
                ["الاخضر"],
            ],
        ],
        [
            ["شارب"],
            [
                ["الصعيد"],
                ["السكير"],
                ["الشعر"],
            ],
        ],
        [
            ["شرطة"],
            [
                ["خط"],
                ["الامن"],
                ["الدفاع"],
            ],
        ],
        [
            ["شعير"],
            [
                ["الشراب"],
                ["العلف"],
                ["الحبوب"],
            ],
        ],
        [
            ["شفاف"],
            [
                ["الماء"],
                ["المصداقية"],
                ["لا غبار عليه"],
            ],
        ],
        [
            ["شهيق"],
            [
                ["شيشة"],
                ["الهواء"],
                ["الرئه"],
            ],
        ],
        [
            ["صفاء"],
            [
                ["الصدق"],
                ["السماء"],
                ["البحر"],
            ],
        ],
        [
            ["قطر"],
            [
                ["الدائرة"],
                ["2020"],
                ["العرب"],
            ],
        ],
        [
            ["تحنيط"],
            [
                ["فرعون"],
                ["الخلود"],
                ["الزعتر"],
            ],
        ],
        [
            ["محيط"],
            [
                ["الدائرة"],
                ["الهادي"],
                ["الاطلسي"],
            ],
        ],
        [
            ["مركز"],
            [
                ["دائرة"],
                ["شرطة"],
                ["البؤرة"],
            ],
        ],
        [
            ["مخطط"],
            [
                ["النمر"],
                ["الحمار الوحشي"],
                ["المستقبل"],
            ],
        ],
        [
            ["الكرم"],
            [
                ["العرب"],
                ["الطائي"],
                ["الوليمة"],
            ],
        ],
        [
            ["الحب"],
            [
                ["روما"],
                ["الام"],
                ["الزواج"],
            ],
        ],
        [
            ["منارة"],
            [
                ["مراكش"],
                ["البحر"],
                ["الحصن"],
            ],
        ],
        [
            ["الحنان"],
            [
                ["الحضن"],
                ["الام"],
                ["الغربة"],
            ],
        ],
        [
            ["موسم"],
            [
                ["حب ملوك صفرو"],
                ["فصول السنة"],
                ["تجمع الناس"],
            ],
        ],
        [
            ["النميمة"],
            [
                ["لحم الميت"],
                ["السيئات"],
                ["اللسان"],
            ],
        ],
        [
            ["الثدييات"],
            [
                ["الدلفين"],
                ["الانسان"],
                ["الحليب"],
            ],
        ],
        [
            ["نجم"],
            [
                ["شعرى", " الثريا"],
                ["شمس"],
                ["سهيل", " مِرزَم"],
            ],
        ],
        [
            ["ديناصور"],
            [
                ["حراشف"],
                ["نيزك"],
                ["جليد"],
            ],
        ],
        [
            ["الحج"],
            [
                ["ركن"],
                ["هاجر"],
                ["الوداع"],
            ],
        ],
        [
            ["الجنة"],
            [
                ["لا حَزَن"],
                ["33"],
                ["بستان"],
            ],
        ],
        [
            ["اليمن"],
            [
                ["خنجر"],
                ["يمين"],
                ["حشيش"],
            ],
        ],
        [
            ["سبأ"],
            [
                ["هدهد"],
                ["فأرة"],
                ["سد"],
            ],
        ],
        [
            ["نينوى"],
            [
                ["نون"],
                ["100000"],
                ["العراق"],
            ],
        ],
        [
            ["موز"],
            [
                ["أصابع"],
                ["أصفر"],
                ["برازيل"],
            ],
        ],
        [
            ["السعودية"],
            [
                ["نخلة"],
                ["سيف"],
                ["حرام"],
            ],
        ],
        [
            ["الجاحظ"],
            [
                ["الحيوان"],
                ["بخل"],
                ["الرسائل"],
            ],
        ],
        [
            ["عبد المطلب"],
            [
                ["زمزم"],
                ["عشرة"],
                ["ذهب"],
            ],
        ],
        [
            ["يثرب"],
            [
                ["عرب"],
                ["يهود"],
                ["تمر"],
            ],
        ],
        [
            ["مالك بن أنس"],
            [
                ["أكباد الإبل"],
                ["مدينة"],
                ["مدونة"],
            ],
        ],
        [
            ["قرطاجة"],
            [
                ["حنبعل"],
                ["فنيقيون"],
                ["تونس"],
            ],
        ],
        [
            ["ابن القيم"],
            [
                ["الكلم الطيب"],
                ["مدرسة"],
                ["سجن"],
            ],
        ],
        [
            ["عمر"],
            [
                ["التاريخ الهجري"],
                ["الفتوحات"],
                ["خلافة"],
            ],
        ],
        [
            ["أبو هريرة"],
            [
                ["دوس"],
                ["سنور"],
                ["حَفّاظ"],
            ],
        ],
        [
            ["يهود"],
            [
                ["تابوت"],
                ["نجمة"],
                ["حائط"],
            ],
        ],
        [
            ["هر"],
            [
                ["من أهل البيت"],
                ["طاهر"],
                ["كنية صحابي"],
            ],
        ],
        [
            ["شكسبير"],
            [
                ["شيخ زبير"],
                ["رواية"],
                ["نابغة"],
            ],
        ],
        [
            ["عين"],
            [
                ["ينبوع ماء"],
                ["عضو"],
                ["جاسوس"],
            ],
        ],
        [
            ["فرنسا"],
            [
                ["خبز"],
                ["جبن"],
                ["ضفادع"],
            ],
        ],
        [
            ["الشافعي"],
            [
                ["شمس"],
                ["قريش"],
                ["الرسالة"],
            ],
        ],
        [
            ["رميصاء"],
            [
                ["أم أنس"],
                ["من نجوم الذراع"],
                ["قذى"],
            ],
        ],
        [
            ["جمل"],
            [
                ["سفينة"],
                ["شيطان"],
                ["لم يكن للحارث في حرب وائل"],
            ],
        ],
        [
            ["انترنت"],
            [
                ["قرية"],
                ["ووو"],
                ["اتصالات"],
            ],
        ],
        [
            ["فايكنغ"],
            [
                ["بحارة"],
                ["قرون"],
                ["ثلج"],
            ],
        ],
        [
            ["جرير"],
            [
                ["نمير"],
                ["زمن بني أمية"],
                ["هجّاء"],
            ],
        ],
        [
            ["ذئب"],
            [
                ["أوس"],
                ["يُقال أن بعض اصناف الجن تخافه"],
                ["متحول"],
            ],
        ],
        [
            ["أويس القرني"],
            [
                ["قرن", "من أهل اليمن"],
                ["بار"],
                ["لم يلقى النبي", "مستجاب الدعوة"],
            ],
        ],
        [
            ["ذو قار"],
            [
                ["شيبان"],
                ["فُرس"],
                ["الطيّار"],
            ],
        ],
        [
            ["كهرباء"],
            [
                ["سيارة في تونس"],
                ["طاقة"],
                ["إضاءة"],
            ],
        ],
        [
            ["الاسماء العشر"],
            [
                ["ابن"],
                ["اثنين"],
                ["اسم"],
            ],
        ],
        [
            ["بنو تميم"],
            [
                ["جمرة"],
                ["الفرزدق وجرير"],
                ["أشد الناس وأطولهم رماحا"],
            ],
        ],
        [
            ["خديجة"],
            [
                ["من الأوائل"],
                ["الشيء قبل أوانه"],
                ["لها البشرى"],
            ],
        ],
        [
            ["جهينة"],
            [
                ["مضرب مثل"],
                ["وكالة إخبارية"],
                ["اليقين"],
            ],
        ],
        [
            ["ثور"],
            [
                ["إله وثني", "ميثولوجيا سكندينافية"],
                ["غار"],
                ["بقر", "يجزئ عن سبع"],
            ],
        ],
        [
            ["رمضان"],
            [
                ["الشديد الحر"],
                ["شهر"],
                ["فرض"],
            ],
        ],
        [
            ["صحن"],
            [
                ["فضائي"],
                ["طبق"],
                ["أكلة"],
            ],
        ],
        [
            ["أحمر"],
            [
                ["بحر"],
                ["دم"],
                ["الجوري"],
            ],
        ],
        [
            ["صحن"],
            [
                ["طائر"],
                ["طبق"],
                ["أكلة"],
            ],
        ],
        [
            ["دمشق"],
            [
                ["جلق"],
                ["بروكار"],
                ["عاصمة"],
            ],
        ],
        [
            ["دمشق"],
            [
                ["جلق"],
                ["بروكار", "عاصمة"],
                ["بلال بن رباح"],
            ],
        ],
        [
            ["شيبان"],
            [
                ["يزيد بن شبيب"],
                ["أحمد بن حنبل"],
                ["هانئ بن مسعود"],
            ],
        ],
        [
            ["يهود"],
            [
                ["مصر"],
                ["بابل"],
                ["عجل"],
            ],
        ],
        [
            ["عبدالدار"],
            [
                ["عبّده لنفسه"],
                ["الحجابة"],
                ["السدانة"],
            ],
        ],
        [
            ["عكاشة"],
            [
                ["سيف الجدل"],
                ["جنة من غير حساب ولا عذاب"],
                ["اِبن محصن"],
            ],
        ],
        [
            ["جهينة"],
            [
                ["مضرب مثل"],
                ["وكالة إخبارية"],
                ["اليقين"],
            ],
        ],
        [
            ["ثور"],
            [
                ["إله وثني"],
                ["غار"],
                ["بقر"],
            ],
        ],
        [
            ["صحن"],
            [
                ["طائر", "فضائي"],
                ["طبق"],
                ["أكلة"],
            ],
        ],
        [
            ["كافر"],
            [
                ["ليل"],
                ["جاحد"],
                ["فلاح"],
            ],
        ],
        [
            ["كتاب"],
            [
                ["جليس"],
                ["لا ريب"],
                ["جامع"],
            ],
        ],
        [
            ["قوارير"],
            [
                ["أنية للماء", "زجاج شفّاف"],
                ["شقائق الرجال"],
                ["حدقة العين"],
            ],
        ],
        [
            ["نعمان"],
            [
                ["شقائق"],
                ["مناذرة"],
                ["دم"],
            ],
        ],
        [
            ["أقمار"],
            [
                ["تيتان"],
                ["ديموس"],
                ["فيبوس"],
            ],
        ],
        [
            ["جمرة"],
            [
                ["فحمة"],
                ["لقب للقبائل"],
                ["ابو طالب"],
            ],
        ],
        [
            ["جمجمة"],
            [
                ["لقب لقبائل"],
                ["قراصنة", "كريستالية"],
                ["عظم"],
            ],
        ],
        [
            ["فأر"],
            [
                ["فويسقة"],
                ["مأرب"],
                ["توم"],
            ],
        ],
        [
            ["فواسق"],
            [
                ["الحدأة", "الغراب الأبقع"],
                ["الحية", "العقرب"],
                ["الفأر"],
            ],
        ],
        [
            ["اثناعشر"],
            [
                ["إمامية"],
                ["شهور"],
                ["الأسباط"],
            ],
        ],
        [
            ["الشرك"],
            [
                ["الصياد"],
                ["الشبكة"],
                ["الكفر"],
            ],
        ],
        [
            ["الجرس"],
            [
                ["الماعز"],
                ["موسكو"],
                ["المدرسة"],
            ],
        ],
        [
            ["الشفاء"],
            [
                ["الدواء"],
                ["العسل"],
                ["القران"],
            ],
        ],
        [
            ["بلقيس"],
            [
                ["هدهد"],
                ["ملكة"],
                ["سليمان"],
            ],
        ],
        [
            ["جمرة"],
            [
                ["خبيثة"],
                ["حجر النار"],
                ["الرماد"],
            ],
        ],
        [
            ["مسافة"],
            [
                ["أميال"],
                ["بين نقطتين"],
                ["مراتون"],
            ],
        ],
        [
            ["راحة"],
            [
                ["اليد"],
                ["النوم"],
                ["هناء"],
            ],
        ],
        [
            ["المرأة"],
            [
                ["الرمل"],
                ["النساء"],
                ["الرؤية"],
            ],
        ],
        [
            ["الرمل"],
            [
                ["الشاطئ"],
                ["الزجاج"],
                ["القوارير"],
            ],
        ],
        [
            ["القوارير"],
            [
                ["انية الماء"],
                ["النساء"],
                ["الرفق"],
            ],
        ],
        [
            ["الرفق"],
            [
                ["الحنان"],
                ["الحيوان"],
                ["العطف"],
            ],
        ],
        [
            ["الحيوان"],
            [
                ["الكلب"],
                ["الارنب"],
                ["الاسد"],
            ],
        ],
        [
            ["الشيب"],
            [
                ["الوقار"],
                ["ابراهيم"],
                ["الشعر"],
            ],
        ],
        [
            ["الكتاب"],
            [
                ["الصديق"],
                ["الونيس"],
                ["القراءة"],
            ],
        ],
        [
            ["أرسطو"],
            [
                ["المشاؤون"],
                ["المعلم الأول"],
                ["فلسفة"],
            ],
        ],
        [
            ["العنقاء"],
            [
                ["نار"],
                ["ريش"],
                ["انبعاث"],
            ],
        ],
        [
            ["بوباي"],
            [
                ["سبانخ"],
                ["غليون"],
                ["زيتون"],
            ],
        ],
        [
            ["سقراط"],
            [
                ["نبات الشوكران"],
                ["إفساد الشباب"],
                ["إفساد الشباب"],
            ],
        ],
        [
            ["ميت"],
            [
                ["سمك"],
                ["جراد"],
                ["كفن"],
            ],
        ],
        [
            ["طروادة"],
            [
                ["معركة"],
                ["خشب"],
                ["صهيل"],
                ["هدية"],
            ],
        ],
        [
            ["بيكاسو"],
            [
                ["ألوان"],
                ["الحمامة"],
                ["لوحات", "رسم"],
            ],
        ],
        [
            ["الدون كيشوت"],
            [
                ["هولندا"],
                ["معارك وهمية"],
                ["طواحين"],
            ],
        ],
        [
            ["أوليفر تويست"],
            [
                ["صبي"],
                ["ميتم"],
                ["مداخن"],
            ]
        ],



        [
            ["كأس"],
            [
                ["ماء"],
                ["العالم"],
                ["كوب"],
            ]
        ],
        [
            ["أحمد"],
            [
                ["ابن حنبل"],
                ["في الإنجيل"],
                ["أُثني"],
            ]
        ],





];
